In [ ]:
- pandas : used for Data base reading writing Modify the data

- numpy  : used for Numerical or math operations

- matplotlib : Used for plotting

- seaborn : Used for plotting

- these are used in data anlysis

In [ ]:
==============================EDA===================================
1) pandas : Data frame operations
2) numpy : math operations
3) matplotlib : plotting or graphs
4) seaborn : plotting or graphs
5) plotly : plotting or graphs
6) bokhe : plotting or graphs
====================== Machine learning ==========================
7) sickit-learn(sklean) : For ALL ML algorithms
8) stats : some statistical operations
====================== Deep learning ================================
9) Tensorflow : Deep learning models (Google)
10) keras : Deep learning models tensorflow as backend
11) pytorch : Deep learning models (Meta)
12) opencv : Image and Video opeartions
13) pillow : Image operations
=================== Object Detection models(Transfer learning)==================
14) Mobilenet : Deep learning packages
15) VGGnet : Deep learning packages
16) Resnet : Deep learning packages
17) Inceptionv3 : Deep learning packages
18) YOLO : Deep learning packages
====================== Natural Language process ===============================
19) NLTK : Natural Langauge Tool Kit
20) SpCy : Alternative to NLTK
21) Wordcloud : Text representation
======================= NLP word Embedding Models ==============================
22) Word2Vec : Google
23) GloVe : Stanford
24) Fasttext : Meta(Face book)
====================== ALLEN NLP (organization) ===========================
25) NLP applications : Pyspark as Backend
======================= Optical Character Recognition(OCR) ===============
Extract the text from the image
26) Tesseract
27) easyocr
=========================BERT=======================================
BERT: Bi directional Encoded Representations from Transformers
28) Transformers : Hugging face (Google)
==================== WebScrapping ===========================
29) SQLITE : Connect the Database using python In [ ]: In [ ]:

30) Selenium
31) Beautiful soup
32) Regex
===================== GenAI and LLM =============================
33) Langchain : To Connect all LLM models
34) GPT : OpenAI
35) Gemini : Google
36) Llama : Meta
37) Grok : XAi
38) BedRock : Amazon
39) Claude AI : Anthropic
=================== Agentic AI==================================
40) Langraph
41) CrewAI
42) Phidata
43) Autogen
==================== API creation==============================
44) Flask
45) FastAPI
46) Gradio
47) Django
===================== WebAppliaction ===========================
48) Streamlit
======================= Model deployment(MLops) ==============================
49) mlflow
50) Kubeflow
========================== Cloud AI =========================================
51) Azure Cognitive services
52) Azure ML Studio
53) GCP vertexAI
54) AWS Sagemaker
=============================== Extra ========================================
55) random
56) time
57) math
58) logging
59) warnings
60) date

**Step-1: Import Packages**

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

**Step-2: Create Dataframe using List**

In [7]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names)

         0
0   Ramesh
1   Suresh
2  Sathish

**step-3: Add Columns**

In [10]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,'Names')

TypeError: Index(...) must be called with a collection of some kind, 'Names' was passed

In [12]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,columns=['Names'])

     Names
0   Ramesh
1   Suresh
2  Sathish

**Step-4: update the index**

In [15]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,'A')

TypeError: Index(...) must be called with a collection of some kind, 'A' was passed

In [17]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,index=['A'])

ValueError: Shape of passed values is (3, 1), indices imply (1, 1)

In [19]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,index=['A','B','C'])

         0
A   Ramesh
B   Suresh
C  Sathish

In [21]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
pd.DataFrame(names,index=['A','B','C'],columns=['Names'])

     Names
A   Ramesh
B   Suresh
C  Sathish

In [23]:
names=['Ramesh','Suresh','Sathish']
# pd.DataFrame(data,index,columns)
cols=['Names']
idx=['A','B','C']
pd.DataFrame(names,index=idx,columns=cols)

     Names
A   Ramesh
B   Suresh
C  Sathish

**Step-5: Create a DataFrame with Multiple Columns**

In [40]:
names=['Ramesh','Suresh','Sathish']
city=['Hyd','Mumbai','Blr']
# pd.DataFrame(data,index,columns)
cols=['Names','City']
idx=['A','B','C']
data=[names,city]
pd.DataFrame(data)

        0       1        2
0  Ramesh  Suresh  Sathish
1     Hyd  Mumbai      Blr

In [42]:
names=['Ramesh','Suresh','Sathish']
city=['Hyd','Mumbai','Blr']
# pd.DataFrame(data,index,columns)
cols=['Names','City']
idx=['A','B','C']
data=[names,city]
pd.DataFrame(data).T

         0       1
0   Ramesh     Hyd
1   Suresh  Mumbai
2  Sathish     Blr

In [4]:
import pandas as pd
names=['Ramesh','Suresh','Sathish']
city=['Hyd','Mumbai','Blr']
data=[names,city]
cols=['Names','City']
idx=['A','B','C']
pd.DataFrame(data,index=cols,columns=idx).T

     Names    City
A   Ramesh     Hyd
B   Suresh  Mumbai
C  Sathish     Blr

In [48]:
names=['Ramesh','Suresh','Sathish']
city=['Hyd','Mumbai','Blr']
data=zip(names,city)
cols=['Names','City']
idx=['A','B','C']
pd.DataFrame(data,index=idx,columns=cols)

     Names    City
A   Ramesh     Hyd
B   Suresh  Mumbai
C  Sathish     Blr

In [50]:
names=['Ramesh','Suresh','Sathish']
city=['Hyd','Mumbai','Blr']
age=[20,22,24]
data=zip(names,city,age)
cols=['Names','City','Age']
idx=['A','B','C']
pd.DataFrame(data,index=idx,columns=cols)

     Names    City  Age
A   Ramesh     Hyd   20
B   Suresh  Mumbai   22
C  Sathish     Blr   24

**Step-6: How to add data to empty dataframe**

In [1]:
l=[]
l.append(20)
l
d1={}
d1['Name']=['hima','sri']
d1

s=''
s=s+'a'
s

'a'

In [3]:
import pandas as pd
df=pd.DataFrame()
df['Names']=['Ramesh','suresh','Mahesh']
df['Age']=[20,22,24]
df['City']=['Hyd','Mumbai','Blr']
df

    Names  Age    City
0  Ramesh   20     Hyd
1  suresh   22  Mumbai
2  Mahesh   24     Blr

**Step-7: Create a dataframe using dictionary**

In [82]:
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,22,24],
  'City':['Hyd','Mumbai','blr']}
df=pd.DataFrame(d)
df

    Names  Age    City
0  Ramesh   20     Hyd
1  Suresh   22  Mumbai
2  Mahesh   24     blr

**Step-8: Method**

- shape

- size

- columns

- dtypes

- isnull

In [86]:
df.shape

(3, 3)

In [88]:
df.size # values 9

9

In [90]:
df.columns

Index(['Names', 'Age', 'City'], dtype='object')

In [92]:
df.dtypes

Names    object
Age       int64
City     object
dtype: object

In [97]:
df.isnull()

   Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False

In [99]:
df.isnull().sum

<bound method DataFrame.sum of    Names    Age   City
0  False  False  False
1  False  False  False
2  False  False  False>

In [101]:
# column wise null values not available
df.isnull().sum()

Names    0
Age      0
City     0
dtype: int64

**Step-9: How to rename the column**

In [104]:
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,22,24],
  'City':['Hyd','Mumbai','blr']}
df=pd.DataFrame(d)
df

    Names  Age    City
0  Ramesh   20     Hyd
1  Suresh   22  Mumbai
2  Mahesh   24     blr

In [110]:
# If we want to rename all the columns
df.columns=['A','B','C']
df

        A   B       C
0  Ramesh  20     Hyd
1  Suresh  22  Mumbai
2  Mahesh  24     blr

In [112]:
df.index=['A','B','C']
df

        A   B       C
A  Ramesh  20     Hyd
B  Suresh  22  Mumbai
C  Mahesh  24     blr

In [114]:
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,22,24],
  'City':['Hyd','Mumbai','blr']}
df=pd.DataFrame(d)
df

    Names  Age    City
0  Ramesh   20     Hyd
1  Suresh   22  Mumbai
2  Mahesh   24     blr

In [116]:
df.rename(mapper,index,columns,axis,inplace)
# map is used to dictionary
d={'Names':'A','Age':'B','City':'C'}
df.rename(d)

NameError: name 'mapper' is not defined

In [118]:
df.rename(mapper,index,columns,axis,inplace)
# map is used to dictionary
d={'Names':'A','Age':'B','City':'C'}
df.rename(d,inplace=True)

NameError: name 'mapper' is not defined

In [124]:
# i want to change my columns
# i provided dictionary cloumns
# df.rename(mapper,index,columns,axis,inplace)
# map is used to dictionary
d={'Names':'A','Age':'B','City':'C'}
df.rename(columns=d,inplace=True)
df

        A   B       C
0  Ramesh  20     Hyd
1  Suresh  22  Mumbai
2  Mahesh  24     blr

In [128]:
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,22,24],
  'City':['Hyd','Mumbai','blr']}
d={'Names':'A','Age':'B','City':'C'}
df.rename(index=d,inplace=True)
df

        A   B       C
0  Ramesh  20     Hyd
1  Suresh  22  Mumbai
2  Mahesh  24     blr

In [130]:
# index cannot take names or string 
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,22,24],
  'City':['Hyd','Mumbai','blr']}
d={0:'A',1:'B',2:'C'}
df.rename(index=d,inplace=True)
df

        A   B       C
A  Ramesh  20     Hyd
B  Suresh  22  Mumbai
C  Mahesh  24     blr

In [132]:
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,22,24],
  'City':['Hyd','Mumbai','blr']}
d={0:'A',1:'B',2:'C'}
df.rename(d,inplace=True)
df

        A   B       C
A  Ramesh  20     Hyd
B  Suresh  22  Mumbai
C  Mahesh  24     blr

In [134]:
d={'Names':['Ramesh','Suresh','Mahesh'],
  'Age':[20,22,24],
  'City':['Hyd','Mumbai','blr']}
d={0:'A',1:'B',2:'C'}
df.rename(d,axis=1,inplace=True)
df

        A   B       C
A  Ramesh  20     Hyd
B  Suresh  22  Mumbai
C  Mahesh  24     blr

In [ ]:
# inplace means override

In [3]:
# creating dataframe using dictionary
import pandas as pd
d={'Names':['hima','sri','hams','sindhu'],'age':[20,22,24,26],'city':['hyd','blr','chennai','mumbai']}
df=pd.DataFrame(d)
df

    Names  age     city
0    hima   20      hyd
1     sri   22      blr
2    hams   24  chennai
3  sindhu   26   mumbai

In [11]:
import pandas as pd
df=pd.DataFrame()
df['Names']=['hima','sri']
df['age']=[20,22]
df

  Names  age
0  hima   20
1   sri   22

In [15]:
import pandas as pd
d1={'Names':['hima','sri','hams','sindhu'],'age':[20,22,24,26],'city':['hyd','blr','chennai','mumbai']}
df=pd.DataFrame(d1)
df

    Names  age     city
0    hima   20      hyd
1     sri   22      blr
2    hams   24  chennai
3  sindhu   26   mumbai

In [21]:
df.columns=['A','b','c']
df

        A   b        c
0    hima  20      hyd
1     sri  22      blr
2    hams  24  chennai
3  sindhu  26   mumbai

In [27]:
df.index=[1,2,3,4]
df

        A   b        c
1    hima  20      hyd
2     sri  22      blr
3    hams  24  chennai
4  sindhu  26   mumbai

In [29]:
import pandas as pd
d1={'Names':['hima','sri','hams','sindhu'],'age':[20,22,24,26],'city':['hyd','blr','chennai','mumbai']}
df=pd.DataFrame(d1)
df

    Names  age     city
0    hima   20      hyd
1     sri   22      blr
2    hams   24  chennai
3  sindhu   26   mumbai

In [41]:
d1={'Names':'A','age':'B','city':'C'}
df.rename(columns=d1,inplace=True)
df

        A   B        C
0    hima  20      hyd
1     sri  22      blr
2    hams  24  chennai
3  sindhu  26   mumbai

In [45]:
d1={0:'A',1:'B',2:'C'}
df.rename(index=d1,inplace=True)
df

        A   B        C
A    hima  20      hyd
B     sri  22      blr
C    hams  24  chennai
3  sindhu  26   mumbai

In [49]:
d1={'A':'names','B':'ages','C':'City'}
d2={'A':1,'B':2,'C':3,3:4}
df.rename(index=d2,columns=d1,inplace=True)
df

    names  ages     City
1    hima    20      hyd
2     sri    22      blr
4    hams    24  chennai
4  sindhu    26   mumbai

In [ ]:
# veo3

**Step-10: How to add a new data to existed dataframe**

In [62]:
import pandas as pd
d1={'Names':['hima','sri','hams','sindhu'],'age':[20,22,24,26],'city':['hyd','blr','chennai','mumbai']}
df=pd.DataFrame(d1)
df['Marks']=[100,200,300,400]  # adding a new column

df

    Names  age     city  Marks
0    hima   20      hyd    100
1     sri   22      blr    200
2    hams   24  chennai    300
3  sindhu   26   mumbai    400

In [64]:
import pandas as pd
d1={'Names':['hima','sri','hams','sindhu'],'age':[20,22,24,26],'city':['hyd','blr','chennai','mumbai']}
df=pd.DataFrame(d1)
df['Marks']=[100,200,300,400]  # adding a new column
df['age']=[10,20,30,40]   # modify the exist column
df

    Names  age     city  Marks
0    hima   10      hyd    100
1     sri   20      blr    200
2    hams   30  chennai    300
3  sindhu   40   mumbai    400

**step-11: save the dataframe**

- if we want to read or write we need 3 values

    - where you want to save
    
    - on which name you want to save
    
    - on which format you want to save

- filename.txt

- filename.csv or filename.xlsx

- if i provide only file name it will save at cwd

In [67]:
df

    Names  age     city  Marks
0    hima   10      hyd    100
1     sri   20      blr    200
2    hams   30  chennai    300
3  sindhu   40   mumbai    400

In [71]:
df.to_csv('data.csv')
df.to_csv(r'C:\Users\himas\Documents\Naresh_IT\data.csv')

**Step-2: Read the dataframe**

In [74]:
pd.read_csv('data.csv')

   Unnamed: 0   Names  age     city  Marks
0           0    hima   10      hyd    100
1           1     sri   20      blr    200
2           2    hams   30  chennai    300
3           3  sindhu   40   mumbai    400

In [78]:
# to avoid index in csc or excel 
# we have to give index=false to remove index 
df.to_csv('data.csv',index=False)
df.to_csv(r'C:\Users\himas\Documents\Naresh_IT\data.csv',index=False)

In [80]:
df.to_excel('data.xlsx',index=False)
df.to_excel(r'C:\Users\himas\Documents\Naresh_IT\data.xlsx',index=False)

In [82]:
pd.read_excel('data.xlsx')

    Names  age     city  Marks
0    hima   10      hyd    100
1     sri   20      blr    200
2    hams   30  chennai    300
3  sindhu   40   mumbai    400

In [90]:
pd.read_csv(r"C:\Users\himas\Documents\Naresh_IT\bank.csv")

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]

In [88]:
pd.read_csv(r"C:\Users\himas\Documents\Naresh_IT\Visadataset.csv")

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified